In [1]:
import pandas as pd

df = pd.read_csv('data.csv')
df

             Name  Age           City
0        John Doe   25       New York
1        Jane Doe   30    Los Angeles
2       Bob Smith   35        Chicago
3   Alice Johnson   20        Houston
4      Mike Brown   40  San Francisco
5        John Doe   25       New York
6        Jane Doe   30    Los Angeles
7       Bob Smith   35        Chicago
8   Alice Johnson   20        Houston
9      Mike Brown   40  San Francisco
10       John Doe   25       New York
11       Jane Doe   30    Los Angeles
12      Bob Smith   35        Chicago
13  Alice Johnson   20        Houston
14     Mike Brown   40  San Francisco
15       John Doe   25       New York
16       Jane Doe   30    Los Angeles
17      Bob Smith   35        Chicago
18  Alice Johnson   20        Houston
19     Mike Brown   40  San Francisco
20       John Doe   25       New York
21       Jane Doe   30    Los Angeles
22      Bob Smith   35        Chicago
23  Alice Johnson   20        Houston
24     Mike Brown   40  San Francisco

In [ ]:
import pandas as pd

df = pd.read_csv('data.csv')

df.head(2)

In [ ]:
import pandas as pd

df = pd.read_csv('data.csv')

df.tail(3)

In [29]:
import pandas as pd

df = pd.read_csv('data.csv')

# #5. Display the shape of the DataFrame.
df.shape

(25, 3)

In [30]:
import pandas as pd

df = pd.read_csv('data.csv')

# #6. Display the columns of the DataFrame.
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [31]:
import pandas as pd

df = pd.read_csv('data.csv')
# #7. Display the data types of the columns in the DataFrame.
df.dtypes

Name    object
Age      int64
City    object
dtype: object

In [43]:
from itertools import count
import pandas as pd

df = pd.read_csv('data.csv')

# #8. Display the summary statistics of the DataFrame.
df.describe()

np.float64(30.0)

In [44]:
from itertools import count
import pandas as pd

df = pd.read_csv('data.csv')

#9. Display the unique values in the first column.

df['Name'].unique()

array(['John Doe', 'Jane Doe', 'Bob Smith', 'Alice Johnson', 'Mike Brown'],
      dtype=object)

In [46]:
from itertools import count
import pandas as pd

df = pd.read_csv('data.csv')

#10. Display the number of unique values in the first column.
df['Name'].nunique()

5

In [49]:
from itertools import count
import pandas as pd

df = pd.read_csv('data.csv')

#11. Display the count of each unique value in the first column.
# nÂº de vezes que nome aparece 

df['Name'].value_counts()

Name
John Doe         5
Jane Doe         5
Bob Smith        5
Alice Johnson    5
Mike Brown       5
Name: count, dtype: int64

In [52]:
from itertools import count
import pandas as pd

df = pd.read_csv('data.csv')

#12. Display the sum of the values in the first column.
df['Age'].sum()

np.int64(750)

In [54]:
from itertools import count
import pandas as pd

df = pd.read_csv('data.csv')

#13. Display the mean of the values in the first column.

df['Age'].mean()

np.float64(30.0)

In [56]:
from itertools import count
import pandas as pd

df = pd.read_csv('data.csv')

#14. Display the median of the values in the first column.

df['Age'].median()

np.float64(30.0)

In [57]:
from itertools import count
import pandas as pd

df = pd.read_csv('data.csv')

#15. Display the maximum value in the first column.

df['Age'].max()

np.int64(40)